/* eslint-disable max-len */

const aws = {
  tag: 'AWS',
  name: 'AWS',
  text:
    'Amazon Web Services (AWS) — коммерческое публичное облако, поддерживаемое и развиваемое компанией Amazon с 2006 года. Предоставляет подписчикам услуги как по инфраструктурной модели (виртуальные серверы, ресурсы хранения), так и платформенного уровня (облачные базы данных, облачное связующее программное обеспечение, облачные бессерверные вычисления, средства разработки). В значительной степени (наряду с Google Cloud Platform) повлияло на формирование концепции облачных вычислений в целом, и определило основные направления развития публичной модели развёртывания.',
  links: [
    {
      url: 'https://aws.amazon.com/ru/',
      name: 'Официальная документация',
    },
    {
      url:
        'https://www.youtube.com/playlist?list=PLg5SS_4L6LYsxrZ_4xE_U95AtGsIB96k9',
      name: 'ADV-IT - "AWS На Русском Языке"',
    },
  ],
};

export default aws;
