/* eslint-disable max-len */

const flux = {
  tag: 'Flux',
  name: 'Flux',
  text:
    'Flux — архитектурный подход или набор шаблонов программирования для построения пользовательского интерфейса веб-приложений, сочетающийся с реактивным программированием и построенный на однонаправленных потоках данных. Согласно замыслу создателей и несмотря на то, что Facebook предоставил реализацию Flux в дополнение к React, Flux не является ещё одним веб-фреймворком, а является архитектурным решением.',
  links: [
    {
      url: 'https://facebook.github.io/flux/',
      name: 'Официальная документация и небольшой туториал',
    },
  ],
};

export default flux;
