/* eslint-disable max-len */

const interpretersPython = {
  // TODO: Добавить материалы
  tag: 'Python interpreters',
  name: 'Python interpreters',
  text:
    'Эталонной реализацией Python является интерпретатор CPython, поддерживающий большинство активно используемых платформ. Он распространяется под свободной лицензией Python Software Foundation License, позволяющей использовать его без ограничений в любых приложениях, включая проприетарные. Однако это далеко не единственный (как в nodejs) интерпретатор для данного языка. Есть реализация интерпретатора для JVM с возможностью компиляции, CLR, LLVM, другие независимые реализации. Например интерпретатор PyPy использует JIT-компиляцию, которая значительно увеличивает скорость выполнения Python-программ. Углубленное изучение интерпретаторов даёт вам возможность разобраться в процессе работы языка программирования и стать настоящим экспертом.',
  links: [
    {
      url: 'https://habr.com/ru/post/209812/',
      name: 'Хабр - "Почему существует так много Питонов?"',
    },
    {
      url: 'https://www.youtube.com/watch?v=at30AmjPsy4',
      name: 'MoscowPython - Что внутри у Питона: как работает интерпретатор',
    },
  ],
};

export default interpretersPython;
