/* eslint-disable max-len */

const jenkins = {
  tag: 'Jenkins',
  name: 'Jenkins',
  text:
    'Jenkins — программная система с открытым исходным кодом на Java, предназначенная для обеспечения процесса непрерывной интеграции программного обеспечения. Ответвлена в 2008 году от проекта Hudson, принадлежащего компании Oracle, основным его автором — Косукэ Кавагути. Распространяется под лицензией MIT. Позволяет автоматизировать часть процесса разработки программного обеспечения, в котором не обязательно участие человека, обеспечивая функции непрерывной интеграции. Работает в сервлет-контейнере, например, Apache Tomcat. Поддерживает инструменты системы управления версиями, включая AccuRev, CVS, Subversion, Git, Mercurial, Perforce, Clearcase и RTC. Может собирать проекты с использованием Apache Ant и Apache Maven, а также выполнять произвольные сценарии оболочки и пакетные файлы Windows. Сборка может быть запущена разными способами, например, по событию фиксации изменений в системе управления версиями, по расписанию, по запросу на определённый URL, после завершения другой сборки в очереди. Возможности Jenkins можно расширять с помощью плагинов. Контроль доступа реализуется двумя способами: проверкой подлинности пользователя и авторизацией. Поддерживается защита от внешних угроз, в том числе от CSRF-атак и вредоносных сборок.',
  links: [
    {
      url: 'https://jenkins.io/doc/',
      name: 'Официальная документация',
    },
    {
      url:
        'https://www.youtube.com/playlist?list=PLg5SS_4L6LYvQbMrSuOjTL1HOiDhUE_5a',
      name: 'ADV-IT - "Jenkins На Русском Языке"',
    },
  ],
};

export default jenkins;
