/* eslint-disable max-len */

const kafka = {
  tag: 'Kafka',
  name: 'Kafka',
  text:
    'Kafka — распределённый программный брокер сообщений, проект с открытым исходным кодом, разрабатываемый в рамках фонда Apache. Написан на языке программирования Scala и Java. Спроектирован как распределённая, горизонтально масштабируемая система, обеспечивающая наращивание пропускной способности как при росте числа и нагрузки со стороны источников, так и количества систем-подписчиков. Подписчики могут быть объединены в группы. Поддерживается возможность временного хранения данных для последующей пакетной обработки. Одной из особенностей реализации инструмента является применение техники, сходной с журналами транзакций, используемыми в системах управления базами данных.',
  links: [
    {
      url: 'https://kafka.apache.org/documentation/',
      name: 'Официальная документация',
    },
    {
      url: 'https://www.youtube.com/watch?v=3hVMXhqYhXc',
      name: 'Real time chart data with Angular2 and Kafka',
    },
    {
      url: 'https://www.youtube.com/watch?v=udnX21__SuU',
      name: 'Kafka Tutorial - Core Concepts',
    },
  ],
};

export default kafka;
