/* eslint-disable max-len */

const koa = {
  tag: 'Koa',
  name: 'Koa',
  text:
    'Koa — Koa был создан командой разработчиков, как вариант фреймворка Express в новом поколении. Такая улучшенная версия разрабатывалась для создания веб-приложений и API с повышенной производительностью. Соответственно, создатели стремились учесть все недостатки предшественника и сделать его более современным и удобным в использовании. Koa обладает практически таким же функционалом и превосходит Express по легкости. Характерной особенностью Koa является использование генераторов ES6. Применение генераторов ES6 в Koa позволяет исключить обратные вызовы (англ. callbacks), уменьшает для разработчиков объем работы с кодом и снижает вероятность ошибок. Благодаря тому, что создателями Koa уже были учтены минусы, выявленные в процессе работы с Express, этот фреймворк может похвастаться тем, что его применение существенно упрощает адаптацию под конкретные запросы клиентов (кастомизацию). А такая характеристика может в итоге сыграть решающую роль в процессе выбора: сегодня в условиях высокой конкуренции любое приложение стремится к использованию своего собственного стиля.',
  links: [
    {
      url: 'https://koajs.com/#introduction',
      name: 'Официальная документация',
    },
    {
      url: 'https://www.youtube.com/watch?v=z84uTk5zmak',
      name:
        'Traversy Media - "Koa.js Crash Course - Modern & Minimalist Node.js Framework"',
    },
    {
      url: 'https://github.com/koajs/kick-off-koa',
      name: 'Kick-off-koa',
    },
    {
      url: 'https://www.youtube.com/watch?v=uwlzpzZhlbE',
      name:
        'Доклад Евгения Пшеничного на конференции HolyJS на тему "Koa и эволюция middleware"',
    },
  ],
};

export default koa;
