/* eslint-disable max-len */

const nestjs = {
  // TODO: Добавить материалы
  tag: 'Nest.js',
  name: 'Nest.js',
  text:
    'Nest.js — Nest (или NestJS) - это платформа для создания эффективных, масштабируемых серверных приложений Node.js. Он использует прогрессивный JavaScript, построен с использованием и полностью поддерживает TypeScript (но все же позволяет разработчикам кодировать на чистом JavaScript) и объединяет элементы OOP (объектно-ориентированное программирование), FP (функциональное программирование) и FRP (функциональное реактивное программирование). Внутри Nest использует надежные платформы HTTP-сервера, такие как Express (по умолчанию), и может быть дополнительно настроен на использование Fastify! Nest обеспечивает уровень абстракции выше этих распространенных сред NodeJS (Express / Fastify), но также предоставляет свои API-интерфейсы непосредственно разработчику. Это позволяет разработчикам свободно использовать множество сторонних модулей, доступных для базовой платформы.',
  links: [
    {
      url: 'https://docs.nestjs.com/',
      name: 'Официальная документация',
    },
    {
      url: 'https://www.youtube.com/watch?v=wqhNoDE6pb4',
      name: 'Traversy Media - "NestJS Crash Course"',
    },
  ],
};

export default nestjs;
