/* eslint-disable max-len */

const p2p = {
  // TODO: Добавить материал
  tag: 'P2P',
  name: 'P2P',
  text:
    'P2P -  одноранговая, децентрализованная, или пиринговая (англ. peer-to-peer, P2P — равный к равному) сеть — оверлейная компьютерная сеть, основанная на равноправии участников. Часто в такой сети отсутствуют выделенные серверы, а каждый узел (peer) является как клиентом, так и выполняет функции сервера. В отличие от архитектуры клиент-сервера, такая организация позволяет сохранять работоспособность сети при любом количестве и любом сочетании доступных узлов. Участниками сети являются все пиры.',
  links: [
    {
      url:
        'https://www.youtube.com/playlist?list=PL1QRvYV-LXn7Mdt7pKOdp7gircj8CwMgk',
      name: "Let's Write Code - P2P / WebRTC",
    },
    {
      url: 'https://github.com/No9/torrential',
      name: 'torrential',
    },
  ],
};

export default p2p;
